import React, { useState } from 'react';
import './Advantages.css'; // Підключення файлу стилів

const Advantages = () => {
  const [activeIndex, setActiveIndex] = useState(0);

  const advantagesData = [
    {
      title: 'Будь-яка локація',
      description: 'Ми доставляємо кальяни в будь-яку точку Львова, незалежно від того, де ви перебуваєте.',
      icon: (
        <svg  className="advantage-svg" fill="#ffffff" version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 395.71 395.71"  stroke="#ffffff"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <g> <path d="M197.849,0C122.131,0,60.531,61.609,60.531,137.329c0,72.887,124.591,243.177,129.896,250.388l4.951,6.738 c0.579,0.792,1.501,1.255,2.471,1.255c0.985,0,1.901-0.463,2.486-1.255l4.948-6.738c5.308-7.211,129.896-177.501,129.896-250.388 C335.179,61.609,273.569,0,197.849,0z M197.849,88.138c27.13,0,49.191,22.062,49.191,49.191c0,27.115-22.062,49.191-49.191,49.191 c-27.114,0-49.191-22.076-49.191-49.191C148.658,110.2,170.734,88.138,197.849,88.138z"></path> </g> </g></svg>
      ),
    },
    {
      title: 'Вибір',
      description: 'У нас широкий асортимент кальянів на будь-який смак, а також широкий вибір табаків.',
      icon: (
        <svg className="advantage-svg" version="1.1" id="Uploaded to svgrepo.com" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32.00 32.00" fill="#ffffff" stroke="#ffffff" stroke-width="0.48" transform="matrix(-1, 0, 0, -1, 0, 0)"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"> <style type="text/css"> </style> <g> <g> <path class="linesandangles_een" d="M10,20c-1.657,0-3,1.343-3,3s1.343,3,3,3s3-1.343,3-3S11.657,20,10,20z M10,24 c-0.551,0-1-0.449-1-1s0.449-1,1-1s1,0.449,1,1S10.551,24,10,24z"></path> <circle class="linesandangles_een" cx="10" cy="16" r="3"></circle> <path class="linesandangles_een" d="M10,6C8.343,6,7,7.343,7,9s1.343,3,3,3s3-1.343,3-3S11.657,6,10,6z M10,10 c-0.551,0-1-0.449-1-1s0.449-1,1-1s1,0.449,1,1S10.551,10,10,10z"></path> <rect x="15" y="8" class="linesandangles_een" width="10" height="2"></rect> <rect x="15" y="15" class="linesandangles_een" width="10" height="2"></rect> <rect x="15" y="22" class="linesandangles_een" width="10" height="2"></rect> </g> <g> <path class="linesandangles_een" d="M10,20c-1.657,0-3,1.343-3,3s1.343,3,3,3s3-1.343,3-3S11.657,20,10,20z M10,24 c-0.551,0-1-0.449-1-1s0.449-1,1-1s1,0.449,1,1S10.551,24,10,24z"></path> <circle class="linesandangles_een" cx="10" cy="16" r="3"></circle> <path class="linesandangles_een" d="M10,6C8.343,6,7,7.343,7,9s1.343,3,3,3s3-1.343,3-3S11.657,6,10,6z M10,10 c-0.551,0-1-0.449-1-1s0.449-1,1-1s1,0.449,1,1S10.551,10,10,10z"></path> <rect x="15" y="8" class="linesandangles_een" width="10" height="2"></rect> <rect x="15" y="15" class="linesandangles_een" width="10" height="2"></rect> <rect x="15" y="22" class="linesandangles_een" width="10" height="2"></rect> </g> </g> </g></svg>
      ),
    },
    {
      title: 'Система лояльності',
      description: 'Для постійних клієнтів діє приваблива система лояльності. Ви можете накопичувати бонуси та отримувати знижки на наступні замовлення.',
      icon: (
        <svg  className="advantage-svg" viewBox="0 0 48 48" id="Layer_2" data-name="Layer 2" xmlns="http://www.w3.org/2000/svg" fill="#ffffff" stroke="#ffffff"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"><defs><style></style></defs><path class="cls-1" d="M6.45,8.4A2,2,0,0,0,4.5,10.35v27.3a2,2,0,0,0,2,2h7.18a11.94,11.94,0,0,1,4.06-3,24,24,0,0,1,9.16-2c.44,0,.88,0,1.32,0a18.72,18.72,0,0,1,3.35.41c4.2.93,7.91,2.82,9.11,4.6h.92a2,2,0,0,0,2-2V10.35a2,2,0,0,0-2-1.95Zm13,6.84A10.1,10.1,0,0,1,21,16.52l1.45,1.35,1.09-1.24,1.08-1.24,1.28,1.26,1.28,1.26,1.22-1.28,1.22-1.28,2.26,2.53L33,16.82c1-.93,1.74-1.54,1.74-1.54s0,1-.06,2.35-.23,3.33-.32,4.46l-.17,2.05L33,24c-.67-.09-3.29-.16-5.83-.16s-5.16.07-5.85.16c-.89.12-.92.09-1.27.13,0-.16-.14-2.39-.3-4.67s-.27-4.16-.25-4.2ZM15,20l.58,1.56,1.68.13-1.31,1,.4,1.63-1.39-.92-1.43.89L14,22.67l-1.29-1.08,1.66-.07L15,20Zm-3.54,4.19,1.07,2.91,3.13.22L13.18,29.2l.75,3.05-2.58-1.72L8.69,32.18l.84-3-2.39-2,3.1-.12,1.18-2.9Zm22.75,0-.08,2.75a6.41,6.41,0,0,1-4,5.93,7.77,7.77,0,0,1-5.95,0,6.41,6.41,0,0,1-4-5.93L20,24.11"></path></g></svg>
      ),
    },
    {
      title: 'Дезінфекція',
      description: 'Ми ретельно очищаємо та дезінфікуємо кальяни після кожного використання. Це гарантує вам безпеку та комфортне куріння.',
      icon: (
        <svg className="advantage-svg"  fill="#ffffff" viewBox="-14.94 0 122.88 122.88" version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg" style={{ enableBackground: 'new 0 0 93 122.88' }}>
        <g id="SVGRepo_bgCarrier" strokeWidth="0"></g>
        <g id="SVGRepo_tracerCarrier" strokeLinecap="round" strokeLinejoin="round"></g>
        <g id="SVGRepo_iconCarrier">
          <g>
            <path d="M14.6,43.74h15.78c4.87,0,6.1,3.36,6.1,7.71c0,2.02-0.29,4.29-0.58,6.49c-0.47,3.64-0.91,7.06,0.09,8.3 c1.67,2.08,4.08,4.49,6.66,7.07c6.39,6.4,13.77,13.79,14.32,20.41c0.33,4.05,0.4,9.27-0.33,14.09c-0.56,3.72-1.61,7.23-3.38,9.85 c-0.91,1.34-1.97,2.54-3.33,3.46c-1.37,0.92-3.02,1.55-5.09,1.74c-0.03,0-0.07,0-0.1,0v0H18.08c-0.05,0-0.1,0-0.14-0.01 c-2.84-0.16-5.4-0.81-7.55-2.13c-2.21-1.36-3.95-3.41-5.1-6.34c-0.03-0.08-0.05-0.16-0.06-0.24c-2.42-11.87-3.41-23.7-2.25-35.36 c1.16-11.71,4.48-23.25,10.68-34.47C13.84,43.95,14.22,43.75,14.6,43.74L14.6,43.74L14.6,43.74z M4.75,84.84 c18.15,4.31,27.95-9.61,44.29-1.6c-2.41-2.85-5.26-5.71-7.92-8.38c-2.62-2.62-5.07-5.08-6.82-7.24c-1.59-1.97-1.09-5.84-0.56-9.95 c0.27-2.1,0.55-4.27,0.55-6.21c0-3.1-0.79-5.51-3.91-5.51H15.25C9.41,56.72,6.26,67.78,5.15,79C4.95,80.94,4.82,82.89,4.75,84.84 L4.75,84.84z M46.12,6.97L46,20.87c0,0.5-0.34,0.92-0.8,1.04l0,0c-3.35,0.95-6.3,2.23-8.56,4.22c-2.2,1.94-3.78,4.6-4.49,8.36v4.75 c0,0.61-0.49,1.1-1.1,1.1H15.12c-0.95,0.09-1.71-0.13-2.3-0.72c-0.54-0.55-0.83-1.39-0.84-2.57c0-0.04,0-0.08,0-0.11 c0.36-3.9-0.44-6.81-2.28-9.08c-1.89-2.32-4.93-4.05-8.98-5.52c-0.57-0.21-0.86-0.83-0.66-1.4l0-0.01h0 c2.19-5.8,5.57-9.5,9.8-11.8 c4.18-2.27,9.16-3.13,14.62-3.28c3.41-0.09,6.84-0.16,10.28-0.17c3.44-0.01,6.87,0.03,10.29,0.16 C45.67,5.85,46.14,6.36,46.12,6.97 L46.12,6.97L46.12,6.97z M43.82,20.04l0.1-12.05c-3.06-0.1-6.11-0.13-9.15-0.12c-3.4,0.01-6.81,0.08-10.23,0.17 c-5.14,0.14-9.79,0.94-13.63,3.02c-3.54,1.92-6.41,4.96-8.39,9.63c3.9,1.52,6.88,3.35,8.88,5.8 c2.21,2.71,3.17,6.11,2.77,10.6 c0.01,0.55,0.09,0.88,0.22,1.02 c0.07,0.07,0.25,0.09,0.52,0.07 c0.06-0.01,0.12-0.02,0.18-0.02h14.87v-3.73h0 c0-0.06,0.01-0.13,0.02-0.19 c0.8-4.36,2.63-7.45,5.21-9.73 C37.56,22.41,40.5,21.04,43.82,20.04L43.82,20.04z M48.36,6.65 l0.09,13.36h6.53c0.92,0.03,1.39-0.74,1.17-2.73V8.9c-0.02-0.73-0.32-1.21-0.88-1.46 L48.36,6.65L48.36,6.65z M70.11,10.99 c1.89,0,3.42,1.29,3.42,2.89c0,1.6-1.53,2.89-3.42,2.89c-1.89,0-3.42-1.29-3.42-2.89C66.69,12.28,68.22,10.99,70.11,10.99 L70.11,10.99z M89.58,10.7c1.89,0,3.42,1.29,3.42,2.89c0,1.6-1.53,2.89-3.42,2.89c-1.89,0-3.42-1.29-3.42-2.89 C86.16,11.99,87.69,10.7,89.58,10.7L89.58,10.7z M89.2,21.59c1.89,0,3.42,1.29,3.42,2.89c0,1.6-1.53,2.89-3.42,2.89 s-3.42-1.29-3.42-2.89C85.78,22.88,87.31,21.59,89.2,21.59L89.2,21.59z M79.75,16.48c1.89,0,3.42,1.29,3.42,2.89 c0,1.6-1.53,2.89-3.42,2.89c-1.89,0-3.42-1.29-3.42-2.89C76.33,17.78,77.86,16.48,79.75,16.48L79.75,16.48z M89.58,0 C91.47,0,93,1.29,93,2.89c0,1.6-1.53,2.89-3.42,2.89c-1.89,0-3.42-1.29-3.42-2.89C86.16,1.29,87.69,0,89.58,0L89.58,0z M79.85,5.49 c1.89,0,3.42,1.29,3.42,2.89c0,1.6-1.53,2.89-3.42,2.89c-1.89,0-3.42-1.29-3.42-2.89C76.42,6.79,77.96,5.49,79.85,5.49L79.85,5.49z M36.89,35.65c1.16-4.65,3.94-7.71,8.62-8.9c1.05,7.48,3.33,13.49,6.51,18.38c1.94,2.74-1.21,5.57-3.48,2.68l-7.36-12.04 L36.89,35.65L36.89,35.65z"></path>
          </g>
        </g>
      </svg>
      ),
    },
    {
      title: 'Робота 24/7',
      description: 'Ми працюємо без вихідних та 24 години на добу, тому ви можете замовити кальян в будь-який час.',
      icon: (
        <svg className="advantage-svg" version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 309.768 309.768" fill="#ffffff">
        <g id="SVGRepo_bgCarrier" strokeWidth="0"></g>
        <g id="SVGRepo_tracerCarrier" strokeLinecap="round" strokeLinejoin="round"></g>
        <g id="SVGRepo_iconCarrier">
          <g>
            <g>
              <path style={{ fill: '#ffffff' }} d="M308.417,122.685c-2.317-4.607-7.223-7.408-12.292-6.967l-15.409,1.126 c-16.714-60.412-72.04-104.968-137.706-104.968C64.154,11.875,0,76.034,0,154.884c0,78.856,64.154,143.009,143.009,143.009 c45.645,0,88.934-22.083,115.798-59.063c4.123-5.689,2.855-13.63-2.823-17.764c-5.689-4.128-13.636-2.845-17.759,2.817 c-22.099,30.421-57.692,48.587-95.222,48.587c-64.839,0-117.582-52.748-117.582-117.582S78.165,37.308,143.004,37.308 c52.22,0,96.549,34.244,111.838,81.434l-8.023,0.587c-5.124,0.37-9.524,3.807-11.139,8.681 c-1.621,4.884-0.131,10.258,3.753,13.619l23.083,19.934c2.246,3.617,6.217,6.037,10.775,6.037c0.239,0,0.462-0.054,0.696-0.065 c0.076,0,0.136,0.033,0.207,0.033c0.305,0,0.615-0.005,0.93-0.033c3.361-0.25,6.483-1.822,8.692-4.373l22.849-26.456 C310.038,132.818,310.723,127.275,308.417,122.685z"></path>
              <g>
                <path style={{ fill: '#ffffff' }} d="M75.772,199.191v-12.347l11.259-10.176c19.031-17.024,28.278-26.815,28.544-36.997 c0-7.109-4.286-12.733-14.348-12.733c-7.5,0-14.071,3.742-18.629,7.239l-5.765-14.62c6.57-4.944,16.752-8.974,28.55-8.974 c19.706,0,30.562,11.525,30.562,27.342c0,14.609-10.584,26.276-23.187,37.53l-8.044,6.701v0.261h32.841v16.763H75.772V199.191z"></path>
                <path style={{ fill: '#ffffff' }} d="M186.261,199.191v-20.783H147.66v-13.26l32.972-53.091h24.933v51.073h10.454v15.278h-10.454 v20.783C205.564,199.191,186.261,199.191,186.261,199.191z M186.261,163.13v-19.298c0-5.232,0.267-10.584,0.669-16.219h-0.533 c-2.823,5.635-5.102,10.726-8.044,16.219l-11.661,19.031v0.267H186.261z"></path>
              </g>
            </g>
          </g>
        </g>
      </svg>
      ),
    },
    {
      title: 'Довіра',
      description: 'Все більше людей довіряють нам свій відпочинок, оскільки ми надаємо високий рівень обслуговування і віддані своїй справі.',
      icon: (
        <svg className="advantage-svg" viewBox="0 0 192 192" xmlns="http://www.w3.org/2000/svg" fill="none"><g id="SVGRepo_bgCarrier" stroke-width="0"></g><g id="SVGRepo_tracerCarrier" stroke-linecap="round" stroke-linejoin="round"></g><g id="SVGRepo_iconCarrier"><path stroke="#ffffff" stroke-linecap="round" stroke-linejoin="round" stroke-miterlimit="10" stroke-width="12" d="M95.958 22C121.031 42.867 149.785 42 158 42c-1.797 118.676-15 95-62.042 128C49 137 35.798 160.676 34 42c8.13 0 36.883.867 61.958-20Z"></path></g></svg>
      ),
    },
  ];

  return (
    <div className="advantages-container" id="advantages">
    <div className="glowing-container">
      {[1, 2, 3, 4].map((i) => (
        <div key={i} className="glowing">
          {[1, 2, 3].map((j) => (
            <span key={j}></span>
          ))}
        </div>
      ))}
    </div>
    <div><h1 className="advantage-heading">Наші переваги</h1></div>
    <div className="advantage-text">
      {advantagesData.map((advantage, index) => (
        <div key={index} onClick={() => setActiveIndex(index)}>
          <div className='sectionadva'>
            <div>
              {advantage.icon}
              <h2>{advantage.title}</h2>
            </div>
            <div>
              <p>{advantage.description}</p>
            </div>
          </div>
        </div>
      ))}
    </div>
  </div>
  );
};

export default Advantages;





